---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.CannotKeepAnalyticalAdjustment
source: html/85dfcffb-52f5-bbcd-0a36-a3762df94c73.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.CannotKeepAnalyticalAdjustment Property

Analytical model Adjustment distance exceeds current Adjustment Snapping Distance. To adjust snap settings, go to the Structural Settings Dialog.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotKeepAnalyticalAdjustment { get; }
```